month = ['январь', 'февраль', 'март', 'апрель', 'май', 'июнь', 'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь',
         'декабрь']
currency = '[USD]: '
text_income = 'Укажите величину годового дохода:'
data_income = 'Введите доход за'
text_tax_free_income = 'Укажите величину годовой суммы, не облагаемой налогом: '
data_tax_free_income = 'Сумма не облагаемая налогом за'
choice_error = 'нет такого варианта'
tax_cat = ' 1. Субьект,\n 2. Супружеская пара,\n 3. Один родитель.\nВведите категорию налогоплательщика (от 1 до 3):'
sum_income = 'Сумма годового дохода: '
sum_TF_income = 'Сумма годового дохода, не облагаемого налогом: '
sum_tax = 'Величина годового налога: '
m_sum_tax = 'Ежемесячный годовой налог: '
sum_t = 'Сумма годового дохода, облагаемая налогом:'
